PinkFluffyUnic0rn/stm32flash/w25.c
	return 0;
}

static int w25_rewritesector(uint32_t addr, const uint8_t *data,
	uint32_t sz)
{
	int i;

	w25_erasesector(addr);

	for (i = 0; i < sz; i += min(W25_PAGESIZE, sz - i))
		w25_write(addr + i, data + i, W25_PAGESIZE);

	return 0;
}

uint32_t w25fs_checksum(const void *buf, uint32_t size)
{
	uint32_t chk, i;

	chk = 0;
	for (i = 0; i < size / 4; ++i)
		chk ^= ((uint32_t *) buf)[i];

	return chk;
}

static int w25fs_checkdata(uint32_t addr, uint32_t size,
	w25fs_checksum_t cs)
{
	uint8_t buf[W25_PAGESIZE];
	uint32_t i, ccs;

	ccs = 0;
	for (i = 0; i < size; i += W25_PAGESIZE) {
		uint32_t cursz;

		cursz = min(size - i, W25_PAGESIZE);

		w25_read(addr + i, buf, cursz);

		ccs ^= w25fs_checksum(buf, cursz);
	}

	return (ccs == cs);
}

static int w25fs_readsuperblock(struct w25fs_superblock *sb)
{
	int i;

	for (i = 0; i < W25FS_RETRYCOUNT; ++i) {
		w25_read(0, (uint8_t *) (sb),
			sizeof(struct w25fs_superblock));

		if (sb->checksum == w25fs_checksumembed(
			sb, sizeof(struct w25fs_superblock))) {
			break;
		}

		HAL_Delay(Delay[i]);
	}

	return 0;
}

static int w25fs_writesuperblock(struct w25fs_superblock *sb)
{
	int i;

	sb->checksum = w25fs_checksumembed(
		sb, sizeof(struct w25fs_superblock));

	for (i = 0; i < W25FS_RETRYCOUNT; ++i) {
		struct w25fs_superblock sbb;

		w25_rewritesector(0, (uint8_t *) sb,
			sizeof(struct w25fs_superblock));

		w25_read(0, (uint8_t *) &sbb, sizeof(sbb));

		if (sbb.checksum == w25fs_checksumembed(
			&sbb, sizeof(struct w25fs_superblock))) {
			break;
		}
		HAL_Delay(Delay[i]);
	}

	return 0;
}

static uint32_t w25fs_readinode(struct w25fs_inode *in, uint32_t n,
	const struct w25fs_superblock *sb)
{
	int i;

	for (i = 0; i < W25FS_RETRYCOUNT; ++i) {
		w25_read(n, (uint8_t *) in, sizeof(struct w25fs_inode));

		if (in->checksum == w25fs_checksumembed(
			in, sizeof(struct w25fs_inode))) {
			break;
		}

		HAL_Delay(Delay[i]);
	}

	return 0;
}

static uint32_t w25fs_writeinode(const struct w25fs_inode *in,
	uint32_t n, struct w25fs_superblock *sb)
{
	struct w25fs_inode buf[W25FS_INODEPERSECTOR];
	uint32_t inodesector, inodesectorn, inodeid;
	int i;

	inodesector = n / W25_SECTORSIZE * W25_SECTORSIZE;
	inodesectorn = inodesector / W25_SECTORSIZE;
	inodeid	= (n - inodesector) / sizeof(struct w25fs_inode);

	w25_read(inodesector, (uint8_t *) buf, W25_SECTORSIZE);

	memmove(buf + inodeid, in, sizeof(struct w25fs_inode));

	buf[inodeid].checksum = w25fs_checksumembed(
		buf + inodeid, sizeof(struct w25fs_inode));

	sb->inodechecksum[inodesectorn]
		= w25fs_checksum(buf, W25_SECTORSIZE);

	for (i = 0; i < W25FS_RETRYCOUNT; ++i) {
		w25_rewritesector(inodesector,
			(uint8_t *) buf, W25_SECTORSIZE);

		if (w25fs_checkdata(inodesector, W25_SECTORSIZE,
			sb->inodechecksum[inodesectorn])) {
			break;
		}

		HAL_Delay(Delay[i]);
	}

	return 0;
}

static uint32_t w25fs_readdatablock(uint32_t block, uint8_t *data)
{
	uint32_t totalsize;
	int i;

	for (i = 0; i < W25FS_RETRYCOUNT; ++i) {
		w25fs_checksum_t cs;

		w25_read(block, data, W25_SECTORSIZE);

		totalsize = sizeof(struct w25fs_blockmeta)
			+ w25fs_blockgetmeta(data)->datasize;

		cs = w25fs_checksumembed(data, totalsize);

		if (w25fs_blockgetmeta(data)->checksum == cs)
			break;

		HAL_Delay(Delay[i]);
	}

	return 0;
}

static uint32_t w25fs_writedatablock(uint32_t block, uint8_t *data)
{
	struct w25fs_blockmeta *meta;
	uint32_t totalsize;
	int i;

	meta = w25fs_blockgetmeta(data);

	totalsize = sizeof(struct w25fs_blockmeta) + meta->datasize;

	meta->checksum = w25fs_checksumembed(data, totalsize);

	for (i = 0; i < W25FS_RETRYCOUNT; ++i) {
		w25fs_checksum_t cs;

		w25_rewritesector(block, data, totalsize);

		w25_read(block, (uint8_t *) &cs,
			sizeof(w25fs_checksum_t));

		if (w25fs_checkdataembed(block, totalsize, cs))
			break;

		HAL_Delay(Delay[i]);
	}

	return 0;
}

static uint32_t w25fs_createdatablock(struct w25fs_superblock *sb,
	uint32_t sz)
{
	uint32_t block, cursector, nextsector, restsz;
	struct w25fs_blockmeta meta;

	block = sb->freeblocks;

	restsz = sz + sz / W25_SECTORSIZE * sizeof(meta);
	cursector = nextsector = sb->freeblocks;
	while (restsz > 0 && nextsector != 0) {
		uint8_t buf[W25_SECTORSIZE];

		cursector = nextsector;

		restsz = (W25_SECTORSIZE > restsz)
			? 0 : restsz - W25_SECTORSIZE;

		w25fs_readdatablock(cursector, buf);

		nextsector = w25fs_blockgetmeta(buf)->next;
	}

	if (nextsector == 0)
		return _W25FS_NODATABLOCKS;

	sb->freeblocks = nextsector;

	meta.next = 0;
	meta.datasize = 0;

	w25fs_writedatablock(cursector, (uint8_t *) (&meta));

	return block;
}

static uint32_t w25fs_deletedatablock(uint32_t block,
	struct w25fs_superblock *sb)
{
	uint32_t cursector, nextsector;
	struct w25fs_blockmeta meta;

	if (block % W25_SECTORSIZE || block < sb->blockstart)
		return _W25FS_WRONGADDR;

	cursector = nextsector = block;
	while (nextsector != 0) {
		uint8_t buf[W25_SECTORSIZE];

		cursector = nextsector;

		w25fs_readdatablock(cursector, buf);

		nextsector = w25fs_blockgetmeta(buf)->next;
	}

	if (cursector == 0)
		return _W25FS_BADDATABLOCK;

	meta.next = sb->freeblocks;
	meta.datasize = 0;

	w25fs_writedatablock(cursector, (uint8_t *) (&meta));

	sb->freeblocks = block;

	return 0;
}

static uint32_t w25fs_inoderesize(uint32_t n, uint32_t sz)
{
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	uint32_t r;

	w25fs_readsuperblock(&sb);
	w25fs_readinode(&in, n, &sb);

	if (sz <= in.size)
		return 0;

	in.size = sz;

	r = w25fs_deletedatablock(in.blocks, &sb);
	if (w25fs_iserror(r))
		return r;

	in.blocks = w25fs_createdatablock(&sb, sz);
	if (w25fs_iserror(in.blocks))
		return in.blocks;

	w25fs_writeinode(&in, n, &sb);
	w25fs_writesuperblock(&sb);

	return 0;
}

static int w25fs_writeinodeblock(uint32_t inodesectorn, uint8_t *buf,
	struct w25fs_superblock *sb)
{
	uint32_t inodesector;
	int j;

	inodesector = sb->inodestart + inodesectorn * W25_SECTORSIZE;

	sb->inodechecksum[1 + inodesectorn]
		= w25fs_checksum(buf, W25_SECTORSIZE);

	w25_writesector(inodesector, buf, W25_SECTORSIZE);

