PinkFluffyUnic0rn/stm32flash/w25.c
	for (j = 0; j < W25FS_RETRYCOUNT; ++j) {
		if (w25fs_checkdata(inodesector, W25_SECTORSIZE,
			sb->inodechecksum[1 + inodesectorn])) {
			break;
		}

		w25_rewritesector(inodesector, buf, W25_SECTORSIZE);

		HAL_Delay(Delay[j]);
	}

	return 0;
}

uint32_t w25fs_format()
{
	struct w25fs_superblock sb;
	struct w25fs_inode buf[W25FS_INODEPERSECTOR];
	uint32_t inodecnt, p, i;

	w25_eraseall();

	sb.inodecnt = W25FS_INODESSZ / sizeof(struct w25fs_inode);
	sb.inodesz = sizeof(struct w25fs_inode);
	sb.inodestart = W25_SECTORSIZE;
	sb.blockstart = W25_BLOCKSIZE;
	sb.freeinodes = W25_SECTORSIZE;
	sb.freeblocks = W25_BLOCKSIZE;

	inodecnt = W25FS_INODEPERSECTOR * W25FS_INODESECTORSCOUNT;
	for (i = 0; i < inodecnt; ++i) {
		struct w25fs_inode *curin;

		curin = buf + i % W25FS_INODEPERSECTOR;

		curin->nextfree = sb.inodestart + (i + 1) * sb.inodesz;
		curin->blocks = 0;
		curin->size = 0;
		curin->type = W25FS_EMPTY;
		
		curin->checksum = w25fs_checksumembed(
			curin, sizeof(struct w25fs_inode));

		if ((i + 1) % W25FS_INODEPERSECTOR == 0) {
			w25fs_writeinodeblock(i / W25FS_INODEPERSECTOR,
				(uint8_t *) buf, &sb);
		}
	}

	w25fs_writesuperblock(&sb);

	for (p = W25_BLOCKSIZE; p < W25_TOTALSIZE; p += W25_SECTORSIZE) {
		struct w25fs_blockmeta meta;
		int j;

		meta.next = (p + W25_SECTORSIZE >= W25_TOTALSIZE)
			? 0 : p + W25_SECTORSIZE;
		meta.datasize = 0;

		meta.checksum = w25fs_checksumembed(
			&meta, sizeof(meta));

		w25_writesector(p, (uint8_t *) &meta, sizeof(meta));

		for (j = 0; j < W25FS_RETRYCOUNT; ++j) {
			w25fs_checksum_t cs;
				
			w25_read(p, (uint8_t *) &cs,
				sizeof(w25fs_checksum_t));
			
			if (w25fs_checkdataembed(p, sizeof(meta), cs))
				break;

			w25_rewritesector(p, (uint8_t *) &meta,
				sizeof(meta));

			HAL_Delay(Delay[j]);
		}
	}

	return w25fs_dircreate("/");
}

uint32_t w25fs_inodecreate(uint32_t sz, enum W25FS_INODETYPE type)
{
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	uint32_t oldfree;

	w25fs_readsuperblock(&sb);
	w25fs_readinode(&in, sb.freeinodes, &sb);

	oldfree = sb.freeinodes;
	sb.freeinodes = in.nextfree;

	in.nextfree = 0;
	in.type = type;
	in.size = sz;

	in.blocks = w25fs_createdatablock(&sb, sz);
	if (w25fs_iserror(in.blocks))
		return in.blocks;

	w25fs_writeinode(&in, oldfree, &sb);
	w25fs_writesuperblock(&sb);

	return oldfree;
}

uint32_t w25fs_inodedelete(uint32_t n)
{
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	uint32_t r;

	w25fs_readsuperblock(&sb);
	w25fs_readinode(&in, n, &sb);

	if (n < sb.inodestart || n % sb.inodesz)
		return _W25FS_WRONGADDR;

	r = w25fs_deletedatablock(in.blocks, &sb);
	if (w25fs_iserror(r))
		return r;

	in.nextfree = sb.freeinodes;
	in.type = W25FS_EMPTY;
	in.size = 0;
	in.blocks = 0;

	sb.freeinodes = n;

	w25fs_writeinode(&in, n, &sb);
	w25fs_writesuperblock(&sb);

	return 0;
}

uint32_t w25fs_inodeset(uint32_t n, uint8_t *data, uint32_t sz)
{
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	uint32_t block, step, r;
	size_t p;

	w25fs_readsuperblock(&sb);
	w25fs_readinode(&in, n, &sb);

	if (n < sb.inodestart || n % sb.inodesz)
		return _W25FS_WRONGADDR;

	if (w25fs_iserror(r = w25fs_inoderesize(n, sz)))
		return r;

	step = W25_SECTORSIZE - sizeof(struct w25fs_blockmeta);
	block = in.blocks;
	for (p = 0; p < sz; p += step) {
		uint8_t sectorbuf[W25_SECTORSIZE];
		struct w25fs_blockmeta *meta;

		w25fs_readdatablock(block, sectorbuf);

		meta = w25fs_blockgetmeta(sectorbuf);

		meta->datasize = min(sz - p, step);

		memmove(sectorbuf + sizeof(struct w25fs_blockmeta),
			data + p, meta->datasize);

		w25fs_writedatablock(block, sectorbuf);

		block = meta->next;
	}

	return 0;
}

uint32_t w25fs_inodeget(uint32_t n, uint8_t *data, uint32_t sz)
{
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	uint32_t block, step;
	size_t p;

	w25fs_readsuperblock(&sb);
	w25fs_readinode(&in, n, &sb);

	if (n < sb.inodestart || n % sb.inodesz)
		return _W25FS_WRONGADDR;

	if (sz < in.size)
		return _W25FS_WRONGSIZE;

	step = W25_SECTORSIZE - sizeof(struct w25fs_blockmeta);
	block = in.blocks;
	for (p = 0; p < in.size; p += step) {
		uint8_t sectorbuf[W25_SECTORSIZE];

		w25fs_readdatablock(block, sectorbuf);

		memmove(data + p,
			sectorbuf + sizeof(struct w25fs_blockmeta),
			min(in.size - p, step));

		block = w25fs_blockgetmeta(sectorbuf)->next;
	}

	return in.size;
}

uint32_t w25fs_splitpath(const char *path, char **toks, size_t sz)
{
	static char pathbuf[W25FS_DIRRECORDSIZE];
	int i;

	memmove(pathbuf, path, strlen(path) + 1);

	i = 0;

	toks[i++] = strtok(pathbuf, "/");

	while (i < sz && (toks[i++] = strtok(NULL, "/")) != NULL);

	--i;

	if (i >= sz)
		return _W25FS_PATHTOOLONG;

	if (toks[0] == NULL)
		return 0;

	return i;
}

static uint32_t w25fs_dirfindinode(uint8_t *buf, uint32_t n)
{
	uint32_t offset;

	for (offset = 0; ; offset += W25FS_DIRRECORDSIZE) {
		uint32_t nn;

		nn = 0xffffffff;

		memmove(&nn, buf + offset, sizeof(uint32_t));

		if (nn == n)
			return offset;
	}

	return _W25FS_INODENOTFOUND;
}

static uint32_t w25fs_dirsearch(uint8_t *buf, const char *name)
{
	uint32_t offset;

	for (offset = 0; ; offset += W25FS_DIRRECORDSIZE) {
		uint32_t n;

		n = 0xffffffff;

		memmove(&n, buf + offset, sizeof(uint32_t));

		if (n == 0xffffffff)
			return _W25FS_NAMENOTFOUND;

		if (strcmp((char *) buf + offset
				+ sizeof(uint32_t), name) == 0) {
			return n;
		}
	}

	return _W25FS_NAMENOTFOUND;
}

uint32_t w25fs_dirgetinode(const char **path)
{
	struct w25fs_superblock sb;
	uint8_t buf[W25FS_DIRSIZE];
	uint32_t parn;
	const char **p;

	w25fs_readsuperblock(&sb);

	parn = W25FS_ROOTINODE;

	for (p = path; *p != NULL; ++p) {
		struct w25fs_inode in;

		w25fs_readinode((&in), parn, &sb);

		if (in.type != W25FS_DIR)
			return _W25FS_NOTADIR;

		w25fs_inodeget(parn, buf, W25FS_DIRSIZE);

		if (w25fs_iserror(parn = w25fs_dirsearch(buf, *p)))
			return _W25FS_NAMENOTFOUND;
	}

	return parn;
}

static int w25fs_diradd(uint32_t parn, const char *name, uint32_t n)
{
	uint8_t buf[W25FS_DIRSIZE];
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	uint32_t offset, r, b;

	w25fs_readsuperblock(&sb);
	w25fs_readinode(&in, parn, &sb);

	if (in.type != W25FS_DIR)
		return W25FS_ENOTADIR;

